kaidegit/MSP430_Clion_demo/Drivers/driverlib/5xx_6xx/adc10b.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
//adc10b.c - Driver for the ADC10B Module.
//
//*****************************************************************************
#include "driverlib/5xx_6xx/adc10b.h"
#include "inc/hw_types.h"
#ifdef  __IAR_SYSTEMS_ICC__
#include "deprecated/IAR/msp430xgeneric.h"
#else
#include "deprecated/CCS/msp430xgeneric.h"
#endif
#include "driverlib/5xx_6xx/debug.h"

//*****************************************************************************
//
//! Initializes the ADC10B Module.
//!
//! \param baseAddress is the base address of the ADC10B module.
//! \param sampleHoldSignalSourceSelect is the signal that will trigger a
//!       sample-and-hold for an input signal to be converted.
//!        Valid values are
//!        \b ADC10B_SAMPLEHOLDSOURCE_SC [Default]	
//!        \b ADC10B_SAMPLEHOLDSOURCE_1
//!        \b ADC10B_SAMPLEHOLDSOURCE_2
//!        \b ADC10B_SAMPLEHOLDSOURCE_3
//!        This parameter is device specific and sources should be found in the
//!        device's datasheet.
//!        Modified bits are \b ADC10SHSx of \b ADC10CTL1 register.
//! \param clockSourceSelect selects the clock that will be used by the ADC10B
//!       core and the sampling timer if a sampling pulse mode is enabled.
//!        Valid values are
//!        \b ADC10B_CLOCKSOURCE_ADC10OSC - MODOSC 5 MHz oscillator from the UCS
//!            [Default]
//!        \b ADC10B_CLOCKSOURCE_ACLK     - The Auxilary Clock
//!        \b ADC10B_CLOCKSOURCE_MCLK     - The Master Clock
//!        \b ADC10B_CLOCKSOURCE_SMCLK    - The Sub-Master Clock
//!        Modified bits are \b ADC10SSELx of \b ADC10CTL1 register.
//! \param clockSourceDivider selects the amount that the clock will be divided.
//!        Valid values are
//!        \b ADC10B_CLOCKDIVIDER_1 [Default]
//!        \b ADC10B_CLOCKDIVIDER_2
//!        \b ADC10B_CLOCKDIVIDER_3
//!        \b ADC10B_CLOCKDIVIDER_4
//!        \b ADC10B_CLOCKDIVIDER_5
//!        \b ADC10B_CLOCKDIVIDER_6
//!        \b ADC10B_CLOCKDIVIDER_7
//!        \b ADC10B_CLOCKDIVIDER_8
//!        \b ADC10B_CLOCKDIVIDER_12
//!        \b ADC10B_CLOCKDIVIDER_16
//!        \b ADC10B_CLOCKDIVIDER_20
//!        \b ADC10B_CLOCKDIVIDER_24
//!        \b ADC10B_CLOCKDIVIDER_28
//!        \b ADC10B_CLOCKDIVIDER_32
//!        \b ADC10B_CLOCKDIVIDER_64
//!        \b ADC10B_CLOCKDIVIDER_128
//!        \b ADC10B_CLOCKDIVIDER_192
//!        \b ADC10B_CLOCKDIVIDER_256
//!        \b ADC10B_CLOCKDIVIDER_320
//!        \b ADC10B_CLOCKDIVIDER_384
//!        \b ADC10B_CLOCKDIVIDER_448
//!        \b ADC10B_CLOCKDIVIDER_512
//!        Modified bits are \b ADC10DIVx of \b ADC10CTL1 register and
//!         \b ADC10PDIVx of \b ADC10CTL2 register.
//!
//! This function initializes the ADC module to allow for analog-to-digital
//! conversions. Specifically this function sets up the sample-and-hold signal
//! and clock sources for the ADC core to use for conversions. Upon successful
//! completion of the initialization all of the ADC control registers will be
//! reset, excluding the memory controls and reference module bits, the given
//! parameters will be set, and the ADC core will be turned on (Note, that the
//! ADC core only draws power during conversions and remains off when not
//! converting).Note that sample/hold signal sources are device dependent. Note
//! that if re-initializing the ADC after starting a conversion with the
//! startConversion() function, the disableConversion() must be called BEFORE
//! this function can be called.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
unsigned short ADC10B_init (unsigned int baseAddress,
    unsigned int sampleHoldSignalSourceSelect,
    unsigned char clockSourceSelect,
    unsigned int clockSourceDivider)
{
    ASSERT(sampleHoldSignalSourceSelect <= ADC10B_SAMPLEHOLDSOURCE_3);
    ASSERT(clockSourceSelect <= ADC10B_CLOCKSOURCE_SMCLK);
    ASSERT(clockSourceDivider <= ADC10B_CLOCKDIVIDER_512);

    unsigned char retVal = STATUS_SUCCESS;

    //Turn OFF ADC10B Module & Clear Interrupt Registers
    HWREG(baseAddress + OFS_ADC10CTL0) &= ~(ADC10ON + ADC10ENC + ADC10SC);
    HWREG(baseAddress + OFS_ADC10IE)   &= 0x0000; //Reset ALL interrupt enables
    HWREG(baseAddress + OFS_ADC10IFG)  &= 0x0000; //Reset ALL interrupt flags

    //Set ADC10B Control 1
    HWREG(baseAddress + OFS_ADC10CTL1) =
        sampleHoldSignalSourceSelect //Setup the Sample-and-Hold Source
        + (clockSourceDivider & ADC10DIV_7) //Set Clock Divider
        + clockSourceSelect; //Setup Clock Source

    //Set ADC10B Control 2
    HWREG(baseAddress + OFS_ADC10CTL2) =
        (clockSourceDivider & ADC10PDIV_3) //Set Clock Pre-Divider
        + ADC10RES; //Default resolution to 10-bits

