kaidegit/MSP430_Clion_demo/Drivers/driverlib/5xx_6xx/adc10b.c
    return ( retVal) ;
}

//*****************************************************************************
//
//! Enables the ADC10B block.
//!
//! \param baseAddress is the base address of the ADC10B module.
//!
//! This will enable operation of the ADC10B block.
//! Modified bits are \b ADC10ON of \b ADC10CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC10B_enable (unsigned int baseAddress)
{
    //Reset the ADC10ON bit to enable the ADC10B Module
    HWREG(baseAddress + OFS_ADC10CTL0) |= ADC10ON;
}

//*****************************************************************************
//
//! Disables the ADC10B block.
//!
//! \param baseAddress is the base address of the ADC10B module.
//!
//! This will disable operation of the ADC10B block.
//! Modified bits are \b ADC10ON of \b ADC10CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC10B_disable (unsigned int baseAddress)
{
    //Set the ADC10ON bit to disable the ADC10B Module
    HWREG(baseAddress + OFS_ADC10CTL0) &= ~ADC10ON;
}

//*****************************************************************************
//
//! Sets up and enables the Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC10B module.
//! \param clockCycleHoldCount sets the amount of clock cycles to
//!       sample-and-hold for the memory buffer.
//!        Valid values are
//!        \b ADC10B_CYCLEHOLD_4_CYCLES [Default]
//!        \b ADC10B_CYCLEHOLD_8_CYCLES
//!        \b ADC10B_CYCLEHOLD_16_CYCLES
//!        \b ADC10B_CYCLEHOLD_32_CYCLES
//!        \b ADC10B_CYCLEHOLD_64_CYCLES
//!        \b ADC10B_CYCLEHOLD_96_CYCLES
//!        \b ADC10B_CYCLEHOLD_128_CYCLES
//!        \b ADC10B_CYCLEHOLD_192_CYCLES
//!        \b ADC10B_CYCLEHOLD_256_CYCLES
//!        \b ADC10B_CYCLEHOLD_384_CYCLES
//!        \b ADC10B_CYCLEHOLD_512_CYCLES
//!        \b ADC10B_CYCLEHOLD_768_CYCLES
//!        \b ADC10B_CYCLEHOLD_1024_CYCLES
//!        Modified bits are \b ADC10SHTx of \b ADC10CTL0 register.
//! \param multipleSamplesEnabled allows multiple conversions to start
//!       without a trigger signal from the sample/hold signal
//!        Valid values are
//!        \b ADC10B_MULTIPLESAMPLESDISABLE - a timer trigger will be needed to
//!                  start every ADC conversion.
//!        \b ADC10B_MULTIPLESAMPLESENABLE  - during a sequenced and/or repeated
//!                  conversion mode, after the first conversion, no sample/hold
//!                  signal is necessary to start subsequent samples.
//!        Modified bits are \b ADC10MSC of \b ADC10CTL0 register.
//!
//! This function sets up the sampling timer pulse mode which allows the
//! sample/hold signal to trigger a sampling timer to sample-and-hold an input
//! signal for a specified number of clock cycles without having to hold the
//! sample/hold signal for the entire period of sampling. Note that if a
//! conversion has been started with the startConversion() function, then a call
//! to disableConversions() is required before this function may be called.
//!
//! \return None
//
//*****************************************************************************
void ADC10B_setupSamplingTimer (unsigned int baseAddress,
    unsigned int clockCycleHoldCount,
    unsigned short multipleSamplesEnabled)
{
    //Make sure the ENC bit is cleared before setting up sampling pulse mode
    ASSERT( !(HWREG(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    ASSERT(clockCycleHoldCount <= ADC10B_CYCLEHOLD_1024_CYCLES);

    HWREG(baseAddress + OFS_ADC10CTL1) |= ADC10SHP;

    //Reset and Set CB Control 0 Bits
    HWREG(baseAddress + OFS_ADC10CTL0) &= ~(ADC10SHT_15 + ADC10MSC);
    HWREG(baseAddress + OFS_ADC10CTL0) |= clockCycleHoldCount
                                          + multipleSamplesEnabled;
}

//*****************************************************************************
//
//! Disables Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC10B module.
//!
//! Disables the Sampling Timer Pulse Mode. Note that if a conversion has been
//! started with the startConversion() function, then a call to
//! disableConversions() is required before this function may be called.
//!
//! Modified bits are \b ADC10SHP of \b ADC10CTL1 register.
//! \return None
//
//*****************************************************************************
void ADC10B_disableSamplingTimer (unsigned int baseAddress)
{
    //Make sure the ENC bit is cleared before disabling sampling pulse mode
    ASSERT( ~(HWREG(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    HWREG(baseAddress + OFS_ADC10CTL1) &= ~(ADC10SHP);
}

//*****************************************************************************
//
//! Configures the controls of the selected memory buffer.
//!
//! \param baseAddress is the base address of the ADC10B module.
//! \param inputSourceSelect is the input that will store the converted data
//!       into the specified memory buffer.
//!        Valid values are
//!        \b ADC10B_INPUT_A0 [Default]
//!        \b ADC10B_INPUT_A1
//!        \b ADC10B_INPUT_A2
//!        \b ADC10B_INPUT_A3
//!        \b ADC10B_INPUT_A4
//!        \b ADC10B_INPUT_A5
//!        \b ADC10B_INPUT_A6
//!        \b ADC10B_INPUT_A7
//!        \b ADC10B_INPUT_VEREF+
//!        \b ADC10B_INPUT_VEREF-
//!        \b ADC10B_INPUT_TEMPSENSOR
//!        \b ADC10B_INPUT_BATTERYMONITOR
//!        \b ADC10B_INPUT_A12
//!        \b ADC10B_INPUT_A13
//!        \b ADC10B_INPUT_A14
//!        \b ADC10B_INPUT_A15
//!        Modified bits are \b ADC10INCHx of \b ADC10MCTL0 register.
//! \param positiveRefVoltageSourceSelect is the reference voltage source to set
//!       as the upper limit for the conversion that is to be stored in the
//!       specified memory buffer.
//!        Valid values are
//!        \b ADC10B_VREFPOS_AVCC [Default]
//!        \b ADC10B_VREFPOS_EXT
//!        \b ADC10B_VREFPOS_INT
//!        Modified bits are \b ADC10SREF of \b ADC10MCTL0 register.
//! \param negativeRefVoltageSourceSelect is the reference voltage source to set
//!       as the lower limit for the conversion that is to be stored in the
//!       specified memory buffer.
//!        Valid values are
//!        \b ADC10B_VREFPOS_AVSS [Default]
//!        \b ADC10B_VREFPOS_EXT
//!        Modified bits are \b ADC10SREF of \b ADC10CTL0 register.
//!
//! Maps an input signal conversion into the memory buffer, as
//! well as the positive and negative reference voltages for each conversion
//! being stored into the memory buffer. If the internal reference is used for
//! the positive reference voltage, the internal REF module has to control
//! the voltage level. Note that if a conversion has been started with the
//! startConversion() function, then a call to disableConversions() is required
//! before this function may be called.
//!
//! \return None
//
//*****************************************************************************
void ADC10B_memoryConfigure (unsigned int baseAddress,
    unsigned char inputSourceSelect,
    unsigned char positiveRefVoltageSourceSelect,
    unsigned char negativeRefVoltageSourceSelect)
{
    //Make sure the ENC bit is cleared before configuring a Memory Buffer Control
    ASSERT( !(HWREG(baseAddress + OFS_ADC10CTL0) & ADC10ENC) );

    ASSERT(inputSourceSelect <= ADC10B_INPUT_A15);
    ASSERT(positiveRefVoltageSourceSelect <= ADC10B_VREFPOS_INT);
    ASSERT(negativeRefVoltageSourceSelect <= ADC10B_VREFNEG_EXT);

