kaidegit/MSP430_Clion_demo/Drivers/driverlib/5xx_6xx/adc10b.c
    HWREG(baseAddress + OFS_ADC10CTL2) &= ~(ADC10SR);
    HWREG(baseAddress + OFS_ADC10CTL2) |= samplingRateSelect;
}

//*****************************************************************************
//
//! Sets the high and low threshold for the window comparator feature.
//!
//! \param baseAddress is the base address of the ADC10B module.
//! \param highThreshold is the upper bound  that could trip an interrupt for
//!       the window comparator.
//! \param lowThreshold is the lower bound that could trip on interrupt for the
//!       window comparator.
//!
//! Sets the high and low threshold for the window comparator feature. Use the
//! ADC10HIIE, ADC10INIE, ADC10LOIE interrupts to utilize this feature.
//!
//! Modified regsiters are \b ADC10HI and \b ADC10LO.
//!
//! \return NONE
//
//*****************************************************************************
void ADC10B_setWindowComp (unsigned int baseAddress,
    unsigned int highThreshold,
    unsigned int lowThreshold)
{
    HWREG(baseAddress + OFS_ADC10HI) = highThreshold;
    HWREG(baseAddress + OFS_ADC10LO) = lowThreshold;
}

//*****************************************************************************
//
//! Returns the address of the memory buffer for the DMA module.
//!
//! \param baseAddress is the base address of the ADC10B module.
//!
//! Returns the address of the memory buffer. This can be used in conjunction
//! with the DMA to store the converted data directly to memory.
//!
//! \return NONE
//
//*****************************************************************************
unsigned long ADC10B_getMemoryAddressForDMA (unsigned int baseAddress)
{
    return ( baseAddress + OFS_ADC10MEM0 );
}

//*****************************************************************************
//
//! Returns the busy status of the ADC10B core.
//!
//! \param baseAddress is the base address of the ADC10B module.
//!
//! Returns the status of the ADC core if there is a conversion currently taking
//! place.
//!
//! \return ADC10B_BUSY or ADC10B_NOTBUSY dependent if there is a conversion
//!        currently taking place.
//
//*****************************************************************************
unsigned short ADC10B_isBusy (unsigned int baseAddress)
{
    if (HWREG(baseAddress + OFS_ADC10CTL1) & ADC10BUSY){
        return ( ADC10B_BUSY) ;
    } else   {
        return ( ADC10B_NOTBUSY) ;
    }
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************

